#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
cloudflare_zone.kozak_in: Refreshing state... [id=7e83bba5abbc13ea023d9a93f9fbe16c]
cloudflare_zone.sdhveselice_cz: Refreshing state... [id=8eba2604d6382a951f07948621f2e0d3]
cloudflare_zone.kozeltv_cz: Refreshing state... [id=50251f952189c4a427154677dc88057c]
cloudflare_zone.lojzatv_cz: Refreshing state... [id=303d28fa62af4ae718b995d81826b16f]
cloudflare_record.kozeltv_cz_ip_v4: Refreshing state... [id=51a4de5c468cb0519203e5fc6791975b]
cloudflare_record.kozeltv_cz_ip_v6: Refreshing state... [id=a9fd6605443e685fd5761d6eca51262c]
cloudflare_record.kozak_in_spf: Refreshing state... [id=df8e87c2ae502a956e4d609061ba9d5a]
cloudflare_record.kozak_in_sendgrid_em: Refreshing state... [id=aaf3e78f4245e95d19850c110efc91a5]
cloudflare_record.kozak_in_sendgrid_s1: Refreshing state... [id=711b8a21088e8e0ab4ada17b33ac01fc]
cloudflare_record.kozak_in_ip_v4: Refreshing state... [id=aef3bc4f99249c1bb1b0cf3d06238621]
cloudflare_record.kozak_in_ip_v6: Refreshing state... [id=a6cf917b897f54bbaa29ce7950fe7535]
cloudflare_record.kozak_in_mx_1: Refreshing state... [id=a0723f22226ed5010bcbc67582fd0d8f]
cloudflare_record.kozak_in_sendgrid_s2: Refreshing state... [id=287533d36b38df4a1aa66065446f9ced]
cloudflare_record.kozak_in_google_verification: Refreshing state... [id=7510741dbb637307a4ddc5185580a0c9]
cloudflare_record.kozak_in_mx_2: Refreshing state... [id=43b29e5450cfa3f1683c93cd0c531e79]
cloudflare_record.sdhveselice_cz_www_v4: Refreshing state... [id=1ab6a65f3500b3556490c6214733f06b]
cloudflare_record.sdhveselice_cz: Refreshing state... [id=e57973ae25404a0271f8720baf0d4d22]
cloudflare_record.sdhveselice_cz_mx_2: Refreshing state... [id=57af236cc96f125e44d26979ed9f5368]
cloudflare_record.sdhveselice_cz_mx_1: Refreshing state... [id=4e360e0d19c9698167c1c159c9bf6214]
cloudflare_record.lojzatv_cz_ip_v6: Refreshing state... [id=3ff2195ed41ed67bb83293d4be0b39f9]
cloudflare_record.lojzatv_cz_ip_v4: Refreshing state... [id=b0b40def20f6af62419b61808656e84d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.kozak_in_alertmanager will be created
  + resource "cloudflare_record" "kozak_in_alertmanager" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "alertmanager.kozak.in"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "89.221.215.36"
      + zone_id         = "7e83bba5abbc13ea023d9a93f9fbe16c"
    }

  # cloudflare_record.kozak_in_grafana will be created
  + resource "cloudflare_record" "kozak_in_grafana" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "grafana.kozak.in"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "89.221.215.36"
      + zone_id         = "7e83bba5abbc13ea023d9a93f9fbe16c"
    }

  # cloudflare_record.kozak_in_prom will be created
  + resource "cloudflare_record" "kozak_in_prom" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "prom.kozak.in"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "89.221.215.36"
      + zone_id         = "7e83bba5abbc13ea023d9a93f9fbe16c"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kozaktomas, Action: `pull_request`*